[
  {
    "title": "Great opportunities",
    "description": "Great company. The pay is competitive. The discount is nice also. I wish they would go back to 24 hours. People are utilizing the self check out more.",
    "company": "Walmart"
  },
  {
    "title": "A great place to work, am trying to get hired at the walmart in enterprise alabama",
    "description": "What is the best part of working at the company?",
    "company": "Walmart"
  },
  {
    "title": "My Walmart experience",
    "description": "Walmart is a good place to work the company itself is not bad nor is the workers. Although the managers are on a power trip and abuses their power and take advantage of their hard working employees. They overwork the employees without giving a raise",
    "company": "Walmart"
  },
  {
    "title": "Good",
    "description": "Walmart good gives benefits when they let you work the required hours. Also you can just chitchat all day. Super nice to be able to talk to people too.",
    "company": "Walmart"
  },
  {
    "title": "worst job ever",
    "description": "took me off the schedule for two months randomly put me back on. management were pedos and dated my minor friend for extra hours. really crazy how this worked",
    "company": "Walmart"
  },
  {
    "title": "Dont",
    "description": "overall not the best place to work, they do not care about you, they care about statistics and making sure they look good on paper. Even if it means degrading their workers and over working them, making them perform tasks not in the job description.",
    "company": "Walmart"
  },
  {
    "title": "Good job for people in school",
    "description": "To start off they hired 3 of us for a department that was already full & in the process of cutting hours. Promised us 40 hours & set schedules. That was never the case. They consistently scheduled you on days you requested no availability for. They",
    "company": "Walmart"
  },
  {
    "title": "A middle of the road job that lives or dies off management",
    "description": "Overall the job isnt too difficult or stressful, you get sick time at a really slow pace though and the sick leave system is very dumb and set up to make you not use it unless you have no other option. Overall your experience will entirely depend on how good your department leads and coach(es) are",
    "company": "Walmart"
  },
  {
    "title": "Ok",
    "description": "Working as a cashier at Walmart gave me valuable experience in customer service and handling transactions efficiently. The onboarding process was fairly straightforward, and the training provided helped me get comfortable with the register system and",
    "company": "Walmart"
  },
  {
    "title": "Great Company to work for",
    "description": "What is the best part of working at the company?",
    "company": "Walmart"
  },
  {
    "title": "Walmart pays well all that can be said",
    "description": "It's a very physical job, on the docks. You earn your money, you can take off whenever you want if available, and be paid if you have the PTO. I work up front now and I can't take nonpaid days off, if I don't have the PTO I can't take off and it be",
    "company": "Walmart"
  },
  {
    "title": "Coworkers were great; Management sucked",
    "description": "Pros- good pay, steady, coworkers worked together, good benefits",
    "company": "Walmart"
  },
  {
    "title": "You can do better",
    "description": "Some management can be lazy and hard on you for no reason. Not nearly enough workers and always hire part-timers with the most inconvenient schedules for our busiest hours. Management tends to disappear, so unsupervised workers tend to lazy around and",
    "company": "Walmart"
  },
  {
    "title": "Overnight Walmart stocking",
    "description": "It’s Exhausting work,  being an overnight stocker. I’ve been working overnights a year. I have seen many people tap out and walk out. For one they don’t have enough staff most of the time. You will be placed in a position of doing a two or three man",
    "company": "Walmart"
  },
  {
    "title": "Sucks",
    "description": "Too much work for the minimum wage. They smell your a5s. They speak on your back and they have favoritism. When they don't like you they give you more work. When you apply for full-time expect to work for part-time. If you apply part-time you will work full-time.",
    "company": "Walmart"
  },
  {
    "title": "Productive and Friendly working environment",
    "description": "“Effectively communicates with colleagues, supervisors, partners and customers”",
    "company": "Walmart"
  },
  {
    "title": "Productive",
    "description": "Helpful staff pay was not too bad. If anything i wished it was full fime permanent.It was just seasonal but still had some great benefits and discounts",
    "company": "Walmart"
  },
  {
    "title": "Productive and Fast Paced",
    "description": "Good place to work with a strong sense of purpose and direction. Management can struggle to hold proper accountability to lazier associates, but overall are very accommodating and friendly.",
    "company": "Walmart"
  },
  {
    "title": "Mildy friendly atmosphere and always moving.",
    "description": "Working as an overnight set-up (stocking) associate at Walmart involves preparing the store for the next day by restocking shelves, organizing displays, and ensuring the sales floor is clean and ready for customers. The role is physically demanding,",
    "company": "Walmart"
  },
  {
    "title": "Associate",
    "description": "Great company sometimes we get in a little bit of a rush because we dont have enough people but we are still able to get the job done most likely all the time",
    "company": "Walmart"
  },
  {
    "title": "Good place",
    "description": "Had a good experience here. Glad to have done it. The tip to making it through a Walmart shift is too sing very loudly within earshot of customers. Do this and you're guaranteed a promotion!",
    "company": "Walmart"
  }
]